<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" "http://www.w3.org/TR/REC-html40/loose.dtd"><HTML><HEAD><TITLE>Bienvenue dans Iceberg</TITLE></HEAD><BODY BGCOLOR="#FFFFFF" LINK ="#364AFF"><font face="Geneva,Helvetica,Arial" size="1"><B>CHEMIN</B> <A HREF="index.html" style="text-decoration:none">Table des mati&egrave;res</A> &gt; Bienvenue dans Iceberg</FONT><HR><FONT SIZE=6 COLOR="#466AFF"><B>Bienvenue dans Iceberg</B></FONT><BR><P><FONT SIZE=3 COLOR="#466AFF"><B>Avec Iceberg, vous allez pouvoir facilement r&eacute;aliser vos packages et metapackages au sein de la m&ecirc;me application. Cette pr&eacute;face vous pr&eacute;sente une vue d'ensemble des fonctionnalit&eacute;s d'Iceberg.</B></FONT></P><P>Iceberg est un environnement int&eacute;gr&eacute; de cr&eacute;ation de packages. Il vous permet de cr&eacute;er et g&eacute;rer des projets avec une hi&eacute;rarchie complexe de packages et metapackages. Vous pouvez g&eacute;rer la majorit&eacute; des options de packages ou metapackages sans quitter l'application ou faire appel &agrave; des outils externes.</P><A NAME="1"><FONT SIZE=4 COLOR="#466AFF"><B>Aper&ccedil;u rapide des fonctionnalit&eacute;s d'Iceberg</B></FONT></A><BR><BR><B>Gestion de hi&eacute;rarchies complexes de packages et metapackages</B><P>Iceberg vous permet de g&eacute;rer des hi&eacute;rarchies complexes de metapackages et packages au sein d'un seul et m&ecirc;me projet. Vous pouvez ajouter, importer, activer, d&eacute;sactiver ou retirer des composants tr&egrave;s facilement via la liste des Packages et metapackages.<P><CENTER><IMG SRC="images/FR_WELCOME_Components.gif"></CENTER></P>Pour en savoir plus sur la gestion des composants, consultez le chapitre 10, &quot;<A HREF="Managing components.html" style="text-decoration:none">Gestion des composants</A>&quot;.</P><B>Gestion des informations des composants</B><P>Iceberg vous permet de g&eacute;rer des localisations multiples des informations des composants, d'ajouter une ic&ocirc;ne personnalis&eacute;e &agrave; un composant ou bien de s&eacute;lectionner les options d'un package.<P><CENTER><IMG SRC="images/FR_WELCOME_Settings.gif"></CENTER></P>Pour en savoir plus sur la personnalisation des informations et options des composants, consultez le chapitre 6, &quot;<A HREF="Settings Pane.html" style="text-decoration:none">Configuration des composants</A>&quot;.</P><B>Personnalisation des composants</B><P>Iceberg vous permet de choisir une image de fond personnalis&eacute;e pour un composant, des message d'introduction ou des fichiers informatifs localis&eacute;s, des licences utilisateurs &agrave; partir de mod&egrave;les de licence ou bien fournie par vos soins. Le simulateur d'installation vous permet de pr&eacute;-visualiser le r&eacute;sultat sans avoir &agrave; construire le composant et utiliser le <I>Programme d'installation</I>.<P><CENTER><IMG SRC="images/FR_WELCOME_Documents.gif"></CENTER></P>Pour en savoir plus sur la personnalisation des composants, consultez le chapitre 7, &quot;<A HREF="Documents Pane.html" style="text-decoration:none">Personnalisation des composants</A>&quot;.</P><B>D&eacute;finition de pr&eacute;-requis et scripts d'installations</B><P>Iceberg vous permet de d&eacute;finir des pr&eacute;-requis d'installation pour un composant, des scripts &agrave; ex&eacute;cuter avant ou apr&egrave;s l'installation d'un composant et enfin de d&eacute;finir des ressources pouvant &ecirc;tre utilis&eacute;es par ces scripts.<P><CENTER><IMG SRC="images/FR_WELCOME_Scripts.gif"></CENTER></P>Pour en savoir plus sur les pr&eacute;-requis et scripts d'installation, consultez le chapitre 8, &quot;<A HREF="Scripts Pane.html" style="text-decoration:none">D&eacute;finition des pr&eacute;-requis et scripts d'installation des composants</A>&quot;.</P>
<B>D&eacute;finition des plugins d'installations</B><P>Iceberg vous permet d'ajouter des plugins Installer pour un composant. Les plugins Installer vous permettent d'afficher des &eacute;tapes ou panneaux additionnels lors de l'installation d'un composant.<P><CENTER><IMG SRC="images/FR_WELCOME_Plugins.gif"></CENTER></P>Pour en savoir plus, consultez le chapitre 9, &quot;<A HREF="Plugins Pane.html" style="text-decoration:none">D&eacute;finition des plugins Installer</A>&quot;.</P>

<B>D&eacute;finition des &eacute;l&eacute;ments &agrave; installer</B><P>Iceberg vous permet d'ajouter ou retirer facilement des &eacute;l&eacute;ments. Vous pouvez changer les attributs de ces &eacute;l&eacute;ments sans quitter l'application. Vous pouvez &eacute;galement attacher des r&egrave;gles de recherches &agrave; des &eacute;l&eacute;ments dans le cadre de mise &agrave; jour par exemple.<P><CENTER><IMG SRC="images/FR_WELCOME_Files.gif"></CENTER></P>Pour en savoir plus sur la gestion des &eacute;l&eacute;ments &agrave; installer, consultez le chapitre 10, &quot;<A HREF="Files Pane.html" style="text-decoration:none">S&eacute;lection des &eacute;l&eacute;ments &agrave; installer</A>&quot;.</P><A NAME="2"><FONT SIZE=4 COLOR="#466AFF"><B>Resources pour en savoir plus</B></FONT></A><BR><BR><B>Source d'information sur le web</B><P>Vous pouvez trouver des informations d&eacute;taill&eacute;es sur le format des packages et metapackages dans le document <A HREF="http://developer.apple.com/documentation/DeveloperTools/Conceptual/SoftwareDistribution/index.html" style="text-decoration:none">Software Distribution</A>.</P><HR><FONT SIZE="2">Auteur&nbsp;: <I>St&eacute;phane Sudre</I></FONT></BODY></HTML>