<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" "http://www.w3.org/TR/REC-html40/loose.dtd"><HTML><HEAD><TITLE>Configuration du projet</TITLE></HEAD><BODY BGCOLOR="#FFFFFF" LINK ="#364AFF"><font face="Geneva,Helvetica,Arial" size="1"><B>CHEMIN</B> <A HREF="index.html" style="text-decoration:none">Table des mati&egrave;res</A> &gt; Configuration du projet</FONT><HR><FONT SIZE=6 COLOR="#466AFF"><B>Configuration du projet</B></FONT><BR><P>Lorsque vous cr&eacute;ez un nouveau projet &agrave; partir d'un des mod&egrave;les ou bien en important un projet <I>PackageMaker</I>, les options du projet sont positionn&eacute;es par d&eacute;faut. La majorit&eacute; de ces options concernent la construction du projet et de ses composants. Vous pouvez personnaliser ces options.</P><A NAME="1"><FONT SIZE=4 COLOR="#466AFF"><B>Personnalisation de la destination de construction</B></FONT></A><P>Par d&eacute;faut, le ou les composants du projet sont construits dans un dossier <I>build</I> situ&eacute; au m&ecirc;me niveau que le projet. Vous pouvez choisir une autre destination de construction si vous le souhaitez. </P><P><TABLE border="0" cellspacing="1" cellpadding="0" bgcolor="#A1A5A9"><TR><TD><TABLE CELLSPACING="0" CELLPADDING="10" WIDTH="100%"><TR BGCOLOR="#F3F3F3"><TD><FONT SIZE="2"><B>Notes</B>&nbsp;:<UL><LI>La r&eacute;f&eacute;rence vers la destination de construction est par d&eacute;faut un chemin relatif au projet. Il est possible de basculer vers un chemin absolu en utilisant le menu local du champ d'&eacute;dition.<P></P></LI><LI>Le document d&eacute;crit comment modifier la r&eacute;f&eacute;rence avec les dialogues standards d'ouverture de fichier. Il est aussi possible de saisir directement le chemin dans le champ d'&eacute;dition ou bien de glisser-d&eacute;poser un dossier depuis le Finder (sous r&eacute;serve que le champ texte ne soit pas en cours d'&eacute;dition).<P></P></LI></UL></FONT></TD></TR></TABLE></TD></TR></TABLE></P><IMG SRC="images/FR_PROJ_BuildLocation.gif" ALT=""><P><B>Pour modifier la destination de construction&nbsp;:</B><BR><BR><TABLE CELLPADDING="3"><TR VALIGN="TOP"><TD><FONT SIZE="3" COLOR="#364AFF">1</FONT></TD><TD>Choisissez Vue &gt; Projet.</TD></TR><TR VALIGN="TOP"><TD><FONT SIZE="3" COLOR="#364AFF">2</FONT></TD><TD>Cliquez sur le menu local Action de la section Destination de construction et choisissez Choisir&#133;&nbsp;.</TD></TR><TR VALIGN="TOP"><TD><FONT SIZE="3" COLOR="#364AFF">3</FONT></TD><TD>S&eacute;lectionnez ou cr&eacute;ez le dossier que vous souhaitez utiliser comme destination de construction et cliquez sur le bouton Choisir.</TD></TR></TABLE></P><A NAME="2"><FONT SIZE=4 COLOR="#466AFF"><B>S&eacute;lection des options</B></FONT></A><P>Lorsque vous cr&eacute;ez un nouveau projet, des options influen&ccedil;ant la construction de tous les composants ou sp&eacute;cifiquement des packages sont activ&eacute;es par d&eacute;faut. Si vous le souhaitez, vous pouvez modifier cette configuration.</P><IMG SRC="images/FR_PROJ_Options.gif" ALT=""><P><B>Pour activer ou d&eacute;sactiver les options&nbsp;:</B><BR><BR><TABLE CELLPADDING="3"><TR VALIGN="TOP"><TD><FONT SIZE="3" COLOR="#364AFF">1</FONT></TD><TD>Choisissez Vue &gt; Projet.</TD></TR><TR VALIGN="TOP"><TD><FONT SIZE="3" COLOR="#364AFF">2</FONT></TD><TD>Cochez ou d&eacute;cochez les cases de la section Options.</TD></TR></TABLE></P><P>Voici la description des options que vous pouvez activer ou d&eacute;sactiver&nbsp:</P><P><UL><LI><B>&Eacute;liminer tous les fichiers .DS_Store</B>&nbsp;: &eacute;limine de l'archive finale des fichiers des packages tous les fichiers invisibles .DS_Store. Les fichiers .DS_Store sont des fichiers cr&eacute;&eacute;s par le <I>Finder</I> pour sauvegarder les options de pr&eacute;sentations des dossiers.<BR><BR>Par d&eacute;faut, cette option est activ&eacute;e.<P></P></LI><LI><B>&Eacute;liminer tous les fichiers pbdevelopment.plist</B>&nbsp;: &eacute;limine de l'archive finale des fichiers des packages tous les fichiers pbdevelopment.plist. Les fichiers pbdevelopment.plist  sont des fichiers cr&eacute;&eacute;s  dans les dossiers <I>Contents</I> des applications ou bundles par <I>Xcode</I> ou <I>ProjectBuilder</I> afin de les aider &agrave; situer les sources du projet.<BR><BR>Par d&eacute;faut, cette option est activ&eacute;e.<P></P></LI><LI><B>&Eacute;liminer tous les dossiers CVS et .svn</B>&nbsp;: &eacute;limine de l'archive finale des fichiers des packages tous les dossiers CVS et .svn. Les dossiers CVS sont cr&eacute;&eacute;s par le gestionnaire de version du m&ecirc;me nom. Les dossiers .svn sont cr&eacute;&eacute;s par Subversion.<BR><BR>Par d&eacute;faut, cette option est d&eacute;sactiv&eacute;e. <P></P></LI><LI><B>Construire des packages compatibles Mac OS X 10.1</B>&nbsp;: construit des composants qui pourront &ecirc;tre install&eacute;s en utilisant la version du <I>Programme d'installation</I> disponible avec Mac OS X 10.1.x et ant&eacute;rieur.<BR><BR>Par d&eacute;faut, cette option est activ&eacute;e.<P><TABLE border="0" cellspacing="1" cellpadding="0" bgcolor="#A1A5A9"><TR><TD><TABLE CELLSPACING="0" CELLPADDING="10" WIDTH="100%"><TR BGCOLOR="#F3F3F3"><TD><FONT SIZE="2"><B>Note</B>&nbsp;:Le <I>Programme d'installation</I> disponible avec Mac OS X 10.1.x et ant&eacute;rieur ne supporte pas toutes les options d'installation disponibles sur les versions ult&eacute;rieures de Mac OS X.</FONT></TD></TR></TABLE></TD></TR></TABLE></P></LI></UL></P><A NAME="3"><FONT SIZE=4 COLOR="#466AFF"><B>Annotation du projet</B></FONT></A><P>Vous pouvez si vous le souhaitez ajouter des notes ou commentaires sur un projet. Ceci permet par exemple de garder une trace dans le projet des versions d'applications install&eacute;es par la version actuelle du projet.</P><IMG SRC="images/FR_PROJ_Comments.gif" ALT=""><P><B>Pour ajouter ou modifier des notes&nbsp;:</B><BR><BR><TABLE CELLPADDING="3"><TR VALIGN="TOP"><TD><FONT SIZE="3" COLOR="#364AFF">1</FONT></TD><TD>Choisissez Vue &gt; Projet.</TD></TR><TR VALIGN="TOP"><TD><FONT SIZE="3" COLOR="#364AFF">2</FONT></TD><TD>Saisissez vos notes dans l'&eacute;diteur de texte disponible dans la section Commentaires.</TD></TR></TABLE></P><HR><FONT SIZE="2">Auteur&nbsp;: <I>St&eacute;phane Sudre</I></FONT></BODY></HTML>